MorseCode = {'A': '.-', 'B': '-...', 'C': '-.-.', 'D': '-..', 'E': '.', 'F': '..-.',
             'G': '--.', 'H': '....', 'I': '..', 'J': '.---', 'K': '-.-', 'L': '.-..', 'M': '--',
             'N': '-.', 'O': '---', 'P': '.--.', 'Q': '--.-',
             'R': '.-.', 'S': '...', 'T': '-', 'U': '..-', 'V': '...-', 'W': '.--', 'X': '-..-',
             'Y': '-.--', 'Z': '--..',
             '1': '.----', '2': '..---', '3': '...--', '4': '....-',
             '5': '.....',
             '6': '-....', '7': '--...', '8': '---..', '9': '----.', '0': '-----'}
MorseCodeRu = {'З': '−−..',
               'Ы': '−.−−', 'Ь': '−..−',
               'В': '.−−', 'Ж': '...−', 'У': '..−', 'Т': '−', 'С': '...',
               'Р': '.−.', 'Щ': '−−.−', 'П': '.−−.', 'О': '−−−', 'Н': '−.', 'М': '−−', 'Л': '.−..',
               'К': '−.−', 'Й': '.−−−', 'И': '..', 'Х': '....', 'Г': '−−.', 'Ф': '..−.', 'Е': '.',
               'Д': '−..', 'Ц': '−.−.', 'Б': '−...', 'А': '.−', 'Ю': '..−−', 'Ч': '−−−.',
               'Ъ': '−−.−−', 'Э': '..−..', 'Я': '.−.−', 'Ш': '−−−−',
               '1': '.----', '2': '..---', '3': '...--', '4': '....-',
               '5': '.....',
               '6': '-....', '7': '--...', '8': '---..', '9': '----.', '0': '-----'
               }
st = MorseCode


def encode_to_morse(text):
    new_text = ''
    for word in text.split():
        for char in word:
            if char in st:  # Проверка на непереводимые символы, такие символы переведены не будут.
                new_text += st[char] + ' '  # Разделитель между буквами
        new_text += ' '  # Разделитель между словами
    return new_text


def decode_from_morse(text):
    """
     "Переворот" словаря. ключ:значение -> значение:ключ.
     Вследствие чего нет возможности кодировать точку и тире. ('-' == 'Т'; '.' == 'Е'

     Непереводимые символы будут пропущены.
     Однако если непереводимый символ будет стоять без разделителя с буквой,
      то буква переведена не будет.

      −.− −−− −−. −.. .−  −.. . .−.. .− .−..  .−− ... .  ... .− −−  :/
    """
    code = {value: key for key, value in st.items()}
    new_text = ''
    for word in text.split("  "):  # Проход по словам в закодированном тексте
        for char in word.split():  # Проход по буквам в закодированном тексте
            if char in code:
                new_text += code[char]
        new_text += " "
    return new_text.lower()


def main():
    global st
    while True:
        st = MorseCode
        # Достаточно написать только часть слова "Кирилица".
        if input("Кирилица или латиница? ") in "кирилицаkir":
            st = MorseCodeRu
        # Достаточно написать только часть слова "закодировать".
        if input("Закодировать или декодировать? ") in 'закодироватьencode':
            print(encode_to_morse(input().upper()))
        else:
            print(decode_from_morse(input().upper()))


if __name__ == "__main__":
    main()
